-- phpMyAdmin SQL Dump
-- version 4.4.15.10
-- https://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Май 28 2021 г., 14:04
-- Версия сервера: 10.3.29-MariaDB
-- Версия PHP: 5.4.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `md246`
--

-- --------------------------------------------------------

--
-- Структура таблицы `news_md`
--

CREATE TABLE IF NOT EXISTS `news_md` (
  `id_news` int(11) NOT NULL,
  `name` tinytext NOT NULL,
  `body` text NOT NULL,
  `putdate` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `url` tinytext NOT NULL,
  `url_text` tinytext NOT NULL,
  `url_pict` tinytext NOT NULL,
  `hide` enum('show','hide') NOT NULL DEFAULT 'show'
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `news_md`
--

INSERT INTO `news_md` (`id_news`, `name`, `body`, `putdate`, `url`, `url_text`, `url_pict`, `hide`) VALUES
(1, 'Запуск  порталу   MeriDian 246', 'Ну що, ось ми  прийшли до цього. Вже доволі давно було таке бажання зробити нормальну сторінку для нашого гурту, на це все було витрачено багато часу, грошей, нервів і т.п.\r\nАле, як мені здається де що в нас вийшло, і якщо іронізувати, то залишилось тільки навчитись грати :).', '2004-06-24 23:39:00', 'http://md246.com', 'MeriDian 246', 'files/20200504090044.jpg', 'show'),
(2, 'Звіт Меридіан 246 про поїздку на конкурс-відбір для Фестивалю "Тарас Бульба 2019".', 'Чесно кажучи, дуже змішані враження. Для себе вирішили, що нам їздити на подібні відбори для просування гурту не має особливого сенсу. Занадто замішаний елемент "Удачі", на який я б особливо опиратися не став.\r\nпричини\r\n    1. Витратно, дуже витратно. Великі дорожні витрати і таке інше.\r\nІмовірність пройти такий конкурс-відбір не дуже велика. Що б було зрозуміло - в один день на відбір приїхало 25 гуртів. Більшою частиною, звичайно, рівень був у всіх досить високий, хоча вибрати організаторам потрібно було всього 3 колективи.\r\nДо сих пір не розумію, навіщо оргам потрібно було все це шоу з суддями, якщо достатньо було переглянути лайв записи концертів цих колективів, а не зганяти людей з усієї країни, які витратили час, гроші і т.д. До сих пір відчуваємо себе як частини масовки не більше.\r\n    2. Критерії відбору конкурсу дуже спірні.\r\nКонкурс в наш день пройшли три гурти і всі київські. Хоча Особисто я робив ставку і вважав очевидним проходження дуже потужних колективів зі Львова. Але особисто вважаю, один з  київських колективів реально заслуговував на увагу. Тому, враховуємо можливі особисті переваги суддів, які приймають рішення виходячи з власних міркувань і смаків.\r\n    Для прикладу скажу так, якщо ви круті джазери, а судді вважають за краще Рок або Метал або наприклад Поп, не дивуйтеся, якщо вас залишать за бортом. Справа не в вас, як у музикантах, а скоріше в особистому смаку оцінюючих вас людей.\r\n    3. Висновки :)\r\nВважаю наш Меридіан 246 на подібне (в найближчому майбутньому) більше не підпишеться. Я маю на увазі конкурси-відбори для участі десь там, незрозуміло де. (Тобто приїдь, витрать останні, і якщо вдалося пройти, знову приїдь, витрать останні, виступи (безкоштовно до речі) і .... і фсе, давай до побачення). До речі, хто не в курсі, багато фестивалів вимагають плату від учасників за участь, я не жартую, це факт.\r\nДумка про те, що ніхто, нікому, ніде не потрібен, і грошей немає ... :)) вже щільно осіла в моїй голові.\r\nПросуватися потрібно і думаю можливо, але такий спосіб як на мене мало ефективний і витратний. Винятки можна зробити тільки якщо запрошують вже на сам фестиваль в якості учасників. А їздити далеко на відбори, сенсу тепер майже не бачу., Тільки якщо це в розумних межах фінансових можливостей групи.\r\nПозитивний момент звичайно від таких по котушок є - нові знайомства, обмін досвідом, така собі свого роду «школа життя», яку музикант напевно повинен пройти. Якби ми не поїхали туди, висновків би не зробили ніяких.\r\nВласне наш гурт «Меридіан 246» зараз йде в глибоке підпілля :)) студійної звукозапису кількох наших альбомів, які ми найближчим часом анонсуємо. Сподіваємося що ценсу від такої роботи має бути більше.\r\n    4. Висновок\r\nЗвичайно, якщо ВИ просто людина, а не музикант, не особливо розбираєтеся в тонкощах, технічних деталях, стилях, а реагуєте дуже просто - "качає" "не качає":) ...\r\nЗнайте !!! Ви будете слухати на фестивалях те, що за вас вирішать інші люди, які спираються на власні переваги. :)))\r\nХоча, тут я вже засперечався звичайно, але так чи інакше, щось то в такій системі відборів працює неправильно. Якщо вона будується суто на "авторитетній" думці двох-трьох осіб.\r\nВсім Удачі та професійного Зростання !!! \r\nВаш, Меридіан 246\r\n', '2020-05-06 14:49:00', 'www.md246.com', 'MeriDian 246', 'files/20200506145029.jpg', 'show'),
(3, 'Меридіан 246 - Anleon S2 Про вушний моніторинг - досвід нашого гурту', 'Одного гарного дня стало зрозуміло, що вуха нещадно болять, взагалі не чути що вокаліст співає, незрозуміло що грає гітарист,\r\nі незрозуміло що в цьому MD246 взагалі робить басист ...\r\nНа початку шляху з цим ще можна було якось миритися, просто тому що грати толком ще не вміли, а кожні нові досягнення\r\nяк то забирали якість звучання на другий план, і були не особливо важливі.\r\nДо того ж якість обладнання залишала бажати кращого, іншого обладнання не було, то до лайна ми якось звикли.\r\nНасправді нічого нового в цьому для гурту який грає по підвалах як би немає.\r\nІ ось прийшов він - Професійний ЗРІСТ ... час йде, чути починаєш більше, вимоги до якості звучання\r\nзростають, нерви не витримують, всі нервують, кожен хоче вже хоч трохи розуміти що\r\nвін насправді грає, і все таке інше...<br>\r\n\r\nЗаморочились, нашкребли грошей і купили дешеву, вушну моніторну систему\r\n(До речі, пізніше довелося купити електронні барабани).\r\nЗа браком великих коштів вибір припав на пошуки в "Аліекспресс", де була знайдена наступний девайс Anleon S2.\r\nВзяли комплект який містить в собі 4 приймача і 1 передавач, все разом 4800 грн.\r\nУ нас не було досвіду роботи з іншими подібними системами, а тому порівняти особливо було ні з чим.\r\nЩо можу сказати, хлопці це дуже круто насправді ... так до навушників потрібно звикнути,\r\nрепетиції виглядають дивно для стороннього спостерігача, але всі ці дрібниці компенсуються\r\nреальним практичною зручністю. Якість гри підвищується дуже швидко, стають чутні нюанси,\r\nі на перших порах приходить розчарування від власної відстійності нас як музикантів і муки сумнівів у власному професіоналізмі...\r\nАле, час йде, репетиції з такою системою звуку починають реально впливати на якість гри всього MD246,\r\nі ось, десь у далеку з''являється маленька зірочка надії - ще не все втрачено!\r\nПочинаєш розуміти, що хотів ти того чи ні, але це вже інший рівень. Ось Так ось (Невський).<br>\r\n\r\nЩо можу сказати про саму систему ... Дуже не погано, з нюансів це -\r\n1. Потрібно дуже чітко виставити рівень вхідного сигналу в передавач. Якщо переборщити,\r\nзвук буде хрипіти і замикати. Зниження гучності на приймачах нічим не допоможуть.\r\nІдеально, це дати на передавач середній рівень гучності сигналу, а ось на приймачах\r\nкрутити собі гучність яку хто хоче.\r\nРаджу робити не дуже голосно, драйву менше, але розбірливість до аспектів значно вища. <br>\r\n\r\n2. Навушники з комплекту, першу репетицію можна помучитися ... Але ... потім в сміття.\r\nМи відразу не зрозуміли особливої різниці ... все змінилося коли були куплені саме начбто "вушні монітори"\r\nвід KZ ... на тому ж Аліекспресс. Наш вибір припав на KZ ZS5 - 400 грн. У поєднанні з пінними амбушурами,\r\nдають чудовий результат. Хоча підкреслю, з іншими моніторними внутрішньоканальними навушниками\r\nпрацювати не довелось. Але якщо їх порівнювати зі звичайними навушниками затичками, то вони кладуть в нокаут відразу.\r\nРозбірливість сигналу дуже важлива. Наш гітарист "Дмитро Григорієв", який сказав що йому взагалі по ... по барабану в яких навушниках грати, вже через тиждень, другий, дуже засмутився коли втратив один із своіх моніторчиків у дворі будинку, і дуже зрадів коли його правий KZ ZS5 раптово знайшовся. Підкреслю - тільки пінні насадки. Силіконові не дають потрібний рівень ізоляції, з піною навіть баси яскравіше і приємніше слухати.<br>\r\n\r\n3. Розщедритися на акумулятори.\r\nДуже рекомендую це зробити. Ми закупили 8 дюраселовскіх максимальних пальчикових акумулятора, і відразу зарядку\r\nна 8 батарейок. Зручно, вистачає на 2-3 репетиції однієї зарядки. Зарядка заряджає всі 8шт хвилин за 20-25.<br>\r\n\r\n4.Електронниє барабани.\r\nДовелося купити. У нас маленьке приміщення і акустично барабани глушили навіть звук в навушниках, при цьому ми їх спецільно навіть не озвучували.<br>\r\n\r\n5.Цю систему доволі зручно підключати як до пульту, так і до звукової карти... Ми працюємо крізь звукову карту,\r\nта сетап який зроблений на базі програми Reaper. Про наш сетап, та взагалі про гру крізь комп''ютер та звукову карту, трохи пізніше буде стаття.<br>\r\n\r\n6.Май же забув додати... Дуже важливо. Саме ця система з''явилась стерео системою. Це дуже зручно, тому що ми використовуємо один передавач, на 4 приймача. Стерео дає можливість виводити наприклад двох гітаристів у лівий та правий канал. Вони не змішуються, та кожен себе нормально чує. Коли шукав систему, з''ясував...Деякі, навіть більш коштовні(дорогі) системи виявились "моно". Тому це ще один плюс саме для цієї системи. Також важливо пам''ятати, що моніторна система налаштовується суто для музикантів, але налаштування панорами, гучності, компресії... та все таке інше для приміщення, концертної зали, і т.д. Все це робиться вже зовсім окремо. Монітори можливо налаштувати для гурту, та зручно відчувати себе як на репетиційній базі, так і на майданчику. Хоча, звісно... та на справді ми ще з цим усім експериментуємо. Для нас це все робити трохи важко, тому що у гурті немає постійного звукорежисера, і тому вокалісту котрий ще грає зараз у гурті на басу приходиться відволікатися на налаштування цього всього обладнання.\r\n\r\nПоки все ... Якщо з''ясуємо ще якісь нюанси, обов''язково напишемо про це.\r\nВаш Меридіан 246!', '2020-05-06 17:58:00', 'www.md246.com', 'MeriDian 246', 'files/20200506180036.jpg', 'show'),
(4, 'Меридіан 246 - Про Радіо передавачі для гітар Aru 03 Aroma - досвід нашого гурту', 'Уфф, як же я ненавиджу усі ці проводи під ногами, вічно спотикаєшся, вічно якась дергонина...\r\nто він занадто довгий, то він занадто короткий, то вже потрібно перепаювати джек, то екранування занадто слабке...\r\nПривіт всім!...\r\nЯ не відношусь до музикантів старовірів, тільки комбо підсилювач, тільки шнур, тільки аналогова педаль з теплим ламповим посилювачем\r\nонлі хардкор одним словом. Не буду сперечатися, у такому підході є своє щось не погане насправді, але\r\nпрактична зручність під питанням, особливо коли потрібно швидко розгорнути MD246 на якомусь майданчику,\r\nа часу на саунд чек як завжди обмаль, і все одно ніколи не виходить зробити звучання гурту більш схожим на те до чого\r\nзвик у репетиційній базі. Хоча все це інша сторі...\r\nЗараз про шнури :)\r\nІх багато, стоять по різному... однак наш вибір це було покупка більш менш нормального кабелю, та джеків, потім паяльник...\r\nТакий підхід трохи геморойний, але дуже гарна економія в грошах.\r\nТак чи інакше про те щоб завестися якимось радіо передавачем я замислювався вже доволі багато часу... Але, ціна на них, матір божа,\r\nпринаймні так було раніше... І тут звісно алілуя знов "Аліекспресс". Я знайшов там купу варіантів недорогих передавачів,\r\nпара до 1000 грн. Колупався, колупався, та мій вибір пав на Aru 03 Aroma. Чому? Сподобались зовнішньо, та й деякі обзори на ютубе\r\nпідштовхнули у саме цьому напрямку.\r\nБуло придбано відразу 3 комплекти, для ритм гітариста, басиста (тобто мене), та для соло гітариста.\r\nОсь тепер усі плюси та мінуси більш чітко.\r\n\r\nПлюси\r\n1. Ніяких шнурів під ногами. Признаюсь чесно, до цього ще треба звикнути іноді досі я трохи забуваюсь, та коли мені потрібно підійти до ноутбука щоб щось підлаштувати, я по звичці ще роблю це трохи нервуючи, щоб не вирвати зненацька джек, тому що шнур може з''явитись коротким... :) але, шнурів вже нема, я трохи сміюся сам з себе, розслабляюсь,\r\nта вже спокійно йду до ноутбука.\r\n\r\n2. Свобода, Свобода... ніколи не любив бути прив''язаним до чогось... Шнур мені завжди здавався якимось цепом.\r\n\r\n3. Якість звучання... Не помітили ні якої різниці. Можливо вона є, та грізні старовіри та аудіофіли щось таке знайдуть, якщо захотять, але.. мене наприклад якість звучання повністю влаштовує. Навіть фон не такий гучний, як зі шнуром середньої якості.\r\nКоли у перше розрядився акумулятор, та мені прийшлось взяти шнур, я вже приготувався до того що мої налаштування сетапу прийдеться знову регулювати, але це виявилось не так. Нічого переналаштовувати було не потрібно. Рівень гучності сигналу з''явився\r\nтаким самим. Тобто що передавач, що шнур... приблизно те й саме.\r\n\r\n4.Затримка сигналу. Не знаю, нічого не помітили, ніякої затримки.\r\n\r\nМінуси\r\n1. Акумулятори... Цей пристрій потрібно заряджати.. Несподівано так? :)\r\nАкумулятори в строєні, о це справді не є гарно. Якщо пристрій розрядився, замінити батарейки на лету не вийде. Треба втикатись у USB зарядку. Але, щоб було зрозуміло... Одного заряду вистачає на 1,5 репетиції, тобто часа чотири.\r\nНаша репетиція це близько 3х годин. Тому на концерт 1,5 часи вистачить з головою.\r\nХоча я таки заліз у інтернет та знайшов схему за якою можливо переробити пристрій на працю від стороннього більш місткого акумулятору. Тому, якщо вмієте тримати паяльник у долонях, це не є така велика проблема.\r\n\r\n2. Усього 20 метрів. Багато це, чи не дуже... для невеликого майданчика самий раз.\r\nПомітили що для цього пристрою стіни зовсім не мають ніякого значення. Виходили зі свого підвалу\r\nна вулицю у курилку, все працювало як потрібно. Але все ж таки відчуття що 20 метрів це 20 метрів.\r\nБільше краще не ризикувати.\r\n\r\nПоки що все!\r\nВаш Меридіан 246.', '2020-05-07 10:19:00', 'www.md246.com', 'MeriDian 246', 'files/20200507102025.jpg', 'show'),
(5, 'Налаштування репетицій гурту крізь ноутбук та звукову карту від гурту - Меридіан 246. ', 'Частина 1\r\n\r\nНеобхідно\r\n1. Електронні барабани\r\n2. Система вушного моніторингу\r\n3. Ноутбук / Комп''ютер\r\n4. Звукова карта з безліччю входів і виходом\r\n5. Музиканти\r\n6. Інструменти\r\n7. Мікрофони\r\n\r\n\r\nЩо є у нас\r\n1. Електронні барабани Alesys Nitro Kit\r\n2. Система вушного моніторингу Anleon S2 (1 передавач 4 приймача на кожного музиканта)\r\n3. Старенький Фуджитсу Cor 2 Duo 4GB оперативки SSD диск\r\n4. Звукова карта M-Audio Pro Fire 2626 FireWire (довелося купити для неї спец хустці для з''єднання з ноутбуком)\r\n5. Музиканти\r\n6. Інструменти\r\n7. Мікрофони\r\n\r\n\r\nПрограмне забезпечення\r\n1. DAW Reaper\r\nМодулі\r\n2. EZ Drummer VST - Плагін Ударною Установки\r\n3. Guitar Rig VST - Плагін Гітарних і вокальних ефектів\r\n4. Модулі для компресії, лімітування, еквалізірованія використовуємо (рідні Ріперовскіе, тому як менше жеруть ресурсів,\r\nа комп''ютер у нас слабкий, потрібно враховувати що вся обробка йде в реальному часі, під час репетиції а також  концертів).\r\n\r\nЩо в першу чергу зроблено\r\n\r\n1. Повне очищення мастило ноутбука, переустановка Windows 7, подальше вирізання з неї все і вся зайвого не музичне,\r\nвідключення всіх зайвих процесів, всіх зайвих пристроїв, програм і т.д. всього зайвого що може як то вантажити процесор і пам''ять,\r\nі переклад компа в постійну активність без засипання, відключень екрану, сплячих режимів, економних режимів і т.д.\r\nНіяких антивірусів, ніяких індексацій ... Просто гола винда, чистий Ріпер, і строго необхідні плагіни.\r\n\r\n2. Встановлення та налаштування Звуковий карти з FireWire \r\n(байдуже, якщо у вас карта працює з USB 3.0 якщо немає, враховуємо\r\nщо USB 2.0 менш пристосований для роботи зі звуком і взагалі всякими потоками).\r\n3. Установка VST плагінів барабанів, гітар і т.д.\r\n4. Налаштування звучання всього цього Неподобства.\r\n\r\nКанальне розподіл музикантів\r\n\r\nКожному окремому музикантові в Ріпер створюється окрема доріжка, на яку надалі вішається все необхідне ...\r\nЕквалайзер, лімітер, компресор ... не обов''язково все це, залежить просто від реальної потреби.\r\nКожна окрема доріжка прямує на три окремі доріжки, які вже відповідають за вихід звуку за такими\r\nнапрямками\r\n1. Вихід на монітори для музикантів\r\n2. Вихід на Навушники ударнику\r\n3. Вихід в лінію для залу і т.д.\r\n\r\nПриродно кожен з цих виходом налаштовується окремо, наприклад для барабанщика упор на метроном, бектрек, барабани, бас ...\r\nвсе інше злегка приглушається, гітари, вокали і т.д.\r\n\r\nДля моніторів гітаристів, басиста, і вокаліста. Гітари виводяться в ліво і право, якщо гітаристів 2е, так їм простіше почути що вони грають.\r\nВокал по центру, вокалісту вже дуже важливо що він там співає, бас злегка ми засунули назад, і барабани зробили просто\r\nнормального рівню гучності.\r\n\r\nВихід на лінію взагалі тема окрема, налаштовується ситуативно для кожної площадки.\r\nДо того ж передбачаємо що б кожен інструмент, бектрекі, мали можливість передаватися звукорежисеру сцени\r\nокремо, а не в міксі. Тобто, по мимо передбаченого стерео виходу всього міксу на лінію,\r\nпотрібно мати в запасі пресет, який віддасть звук в окремих моно каналах, виняток у нас становить\r\nбектрек, так як він написаний і прописаний з прицілом  на стерео.\r\n\r\nУсі детілі подальшого налаштування цього комплексу буде в окремих статтях. Це все буде стосуватися саме DAW, плагінів, та вже більш детальної комутації.\r\nВаш Меридіан 246.', '2020-05-23 15:44:00', 'www.md246.com', 'MeriDian 246', 'files/20200523154838.jpg', 'show'),
(6, 'Вечір ВаЖКОГО ДРАЙВУ На морі. с.Приморське (Більшовик)', 'Вже завтра 28го їдимо гуртом у селище Приморське (с.Більшовик). Нажаль, Карантин сплутав усі карти, та не дуже велику маємо надію на велику кількість слухачів, але пограти на свіжому морському повітрі, відсняти якийсь відео матеріал, тай взагалі покупатися у морі... Чом би і ні?\r\nПідготували особливу програму, більш меньш важку, динамічну та з єлементами сучасного електро, даба, ритм метал блюза... Отож будемо конкурувати з місцевими діджеями, бо питання про те що важка музика у нашому часі є якийсь "НЕФОРМАТ" вже тривалий час не дає мені спокою. Сподіваємось що потрохи почнемо розвіювати цей міф, а можливо зможемо довісти що така думка зовсім не має сенсу. Особливо коли про запит грати на деяких майданчиках у Залізному Порту, тобі відповідають "МИ ПРИЙМАЄМО ЛИШЕ КАВЕР БЕНДИ". Нудить. Велике спасибі Кафе "Два Капітани", що незважаючи на їхній ПОП, чи більш меньш Шансонний формат, вони не бояться ризикувати, та вирішили спробувати щось зовсім інше! Тримайтеся Діджеї, живий сучасний гурт, з живими інструментами це зовсім вам не ЦЕ! :)  ', '2020-06-27 12:41:00', 'https://www.facebook.com/Meridian246/photos/a.2151352398454895/2655605158029614/?type=3&theater', 'MeriDian 246', 'files/20200627125616.jpg', 'show'),
(7, '@НІЧ ДРАЙВУ@ В URBAN CAD', 'Здоровеньки були хлопці!!!\r\nКажуть що Рок Музика Вмирає, ніде нічого інтересного не коїться... Ну що, думаю це на є правда. Спільно з нашими друзями з Первомайску гурт 69 Кроків, та MeriDian 246\r\n18.07.2020 будемо рвати сцену альтернативним Роком, та ХевиМеталом. Приходьте, готовали цю програму майже 7 місяців. Стерли не одну пачку струн, та замучали не одну гітару :).\r\nТак от, щож це буде... \r\nДумаю 69 Кроків вразять вас своїм скримом, доречі дуже якісним, та своїм справжнім альтенативним драйвом. Що до MD246, ми готуємо щось электронно танцювальне, та будемо сперечатися та конкурувати з клубною танцювальною музикою, але дійсно на сві більш важкий лад.\r\n\r\n<a href="https://www.facebook.com/69krokiv/">\r\nFACEBook - 69 Кроків</a>\r\n\r\n\r\n<iframe width="789" height="444" src="https://www.youtube.com/embed/VXwWF2CJojI" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>', '2020-07-13 14:25:00', '', '', 'files/20200713143238.jpg', 'show'),
(8, 'URBAB CAD 18.07.2020 Як це було.', 'Ну що, хлопчики та дівчатка, сподіваюсь вам сподобалась по справжньому важкка музика від 69 Кроків, та наш новий MD246 формат виступу та нового звучання. Праці було дуже багато, окрім репетицій та організаціонних питань наш гурт отримав дуже велику кількість профіту у плані досвіду.\r\nПо перше ми перевірили наш новий сетап та наше нове обладнання у бойових умовах... Все витримало, були деякі ньюанси відносно моніторної системи, але взагалі все було добре, все працювало як треба. Також великий досвід відносно перформансу, ми зрозуміли що деякі речі у цьому плані потрібно вже змінювати, та доводити до якогось більш меньш іншого рівня. Що саме, о... це поки що секрет навіть для нас :). Але незабаром, вже є ідеї. Так чи інакше ми зрозуміли після цього концерту що зросли.. Але також зрозуміли що це не є край... Лише початок чогось нового, зовсім іншого рівня. Це буде стосуватись майже усього, і того що ми і як ми граємо, і того як ми себе поводимось та як виглядаємо на сцені. До нових Зустрічей!!!  Будемо робити усе щоб здивувати наших слухачів! ', '2020-07-20 12:22:00', 'www.md246.com', 'MeriDian 246', 'files/20200720124522.jpg', 'show');

-- --------------------------------------------------------

--
-- Структура таблицы `RN_DBO_AGREE`
--

CREATE TABLE IF NOT EXISTS `RN_DBO_AGREE` (
  `ID` bigint(20) NOT NULL,
  `PostID` bigint(20) NOT NULL,
  `UserID` bigint(20) NOT NULL,
  `YES` bigint(20) NOT NULL,
  `NO` bigint(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `RN_DBO_COMMENT`
--

CREATE TABLE IF NOT EXISTS `RN_DBO_COMMENT` (
  `ID` bigint(20) NOT NULL,
  `PostID` bigint(20) NOT NULL,
  `UserID` bigint(20) NOT NULL,
  `TEXT` text NOT NULL,
  `Putdate` datetime NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=66 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `RN_DBO_COMMENT`
--

INSERT INTO `RN_DBO_COMMENT` (`ID`, `PostID`, `UserID`, `TEXT`, `Putdate`) VALUES
(1, 10, 34, 'Serov D.A.', '2021-03-25 11:28:53'),
(2, 10, 34, 'SDFGSDFG', '2021-03-25 11:29:56'),
(3, 10, 34, 'DFGSDFGDGHJHJK', '2021-03-25 11:29:59'),
(4, 10, 34, 'WER34R234R234R', '2021-03-25 11:30:02'),
(5, 10, 34, 'dfgsdfgsdfgsdfg', '2021-03-25 11:48:27'),
(6, 10, 34, '12121212', '2021-03-25 11:48:32'),
(7, 10, 34, '45674567456', '2021-03-25 11:48:36'),
(8, 10, 34, '678567856', '2021-03-25 11:49:11'),
(20, 10, 34, ';oiuuyilpuypiuypoiu', '2021-03-25 17:13:44'),
(21, 6, 38, 'wstwgwr', '2021-03-25 17:28:25'),
(25, 6, 41, 'На українській мові, будь ласка, я не розумію', '2021-03-27 15:15:26'),
(26, 1, 41, 'Куплю пипидастр ', '2021-03-27 15:19:15'),
(36, 0, 0, 'fghdfghdfghdfgh', '2021-04-06 23:48:47'),
(37, 0, 0, 'fghdfghdfghdfgh', '2021-04-06 23:48:50'),
(38, 0, 0, 'fghdfghdfghdfgh', '2021-04-06 23:48:51'),
(39, 0, 0, 'fghdfghdfghdfgh', '2021-04-06 23:48:55'),
(58, 15, 34, 'dfghdfghd', '2021-04-17 14:21:40'),
(59, 15, 34, 'zvzxcvzx', '2021-04-17 14:41:14'),
(60, 15, 34, 'sdgsdfgsdfg', '2021-04-17 14:42:31'),
(61, 15, 34, 'sdfsdfsdfgsdf', '2021-04-17 14:42:35'),
(62, 15, 34, 'wefrwfgsdfg', '2021-04-17 14:42:44'),
(63, 15, 34, 'Какой то новый комментарий!!!!!!!', '2021-04-17 14:53:49'),
(64, 17, 34, 'ываваыва', '2021-04-17 14:54:59'),
(65, 17, 34, 'ываыва', '2021-04-17 14:55:01');

-- --------------------------------------------------------

--
-- Структура таблицы `RN_DBO_Config`
--

CREATE TABLE IF NOT EXISTS `RN_DBO_Config` (
  `ID` int(1) NOT NULL,
  `SiteTitle` tinytext NOT NULL,
  `SiteDescription` tinytext NOT NULL,
  `SiteKeywords` tinytext NOT NULL,
  `Domen` tinytext NOT NULL,
  `SiteLogoImg` tinytext NOT NULL,
  `SiteFavicon` tinytext NOT NULL,
  `Email` tinytext NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `RN_DBO_Config`
--

INSERT INTO `RN_DBO_Config` (`ID`, `SiteTitle`, `SiteDescription`, `SiteKeywords`, `Domen`, `SiteLogoImg`, `SiteFavicon`, `Email`) VALUES
(1, 'RedNet - Social Network', 'Communist Social Network', 'keywords', 'http://rednet.md246.com/', 'images/SiteLogo.png', 'images/Favicon.png', 'rednet@gmail.com');

-- --------------------------------------------------------

--
-- Структура таблицы `RN_DBO_FRIENDS`
--

CREATE TABLE IF NOT EXISTS `RN_DBO_FRIENDS` (
  `ID` bigint(20) NOT NULL,
  `UserID` bigint(20) NOT NULL,
  `FriendID` bigint(20) NOT NULL,
  `Status` char(6) NOT NULL,
  `Putdate` datetime NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `RN_DBO_FRIENDS`
--

INSERT INTO `RN_DBO_FRIENDS` (`ID`, `UserID`, `FriendID`, `Status`, `Putdate`) VALUES
(8, 34, 33, 'friend', '2021-03-26 15:24:38'),
(15, 34, 44, 'friend', '2021-03-26 17:08:53'),
(16, 41, 33, 'friend', '2021-03-27 15:18:16'),
(17, 41, 34, 'friend', '2021-03-27 15:18:25'),
(18, 34, 41, 'friend', '2021-03-27 15:19:44'),
(19, 34, 34, 'friend', '2021-03-29 01:34:06'),
(20, 33, 34, 'friend', '2021-04-06 12:43:58');

-- --------------------------------------------------------

--
-- Структура таблицы `RN_DBO_POST`
--

CREATE TABLE IF NOT EXISTS `RN_DBO_POST` (
  `ID` bigint(20) NOT NULL,
  `UserID` bigint(20) NOT NULL,
  `Title` tinytext NOT NULL,
  `Description` text NOT NULL,
  `UpTrust` int(11) NOT NULL,
  `DownTrust` int(11) NOT NULL,
  `YES` int(11) NOT NULL,
  `NO` int(11) NOT NULL,
  `Status` int(2) NOT NULL,
  `WorldStatus` int(11) NOT NULL,
  `Country` char(30) NOT NULL,
  `Region` char(30) NOT NULL,
  `City` char(30) NOT NULL,
  `ColVoView` int(11) NOT NULL,
  `Publication` char(6) NOT NULL,
  `Putdate` datetime NOT NULL,
  `Foto` tinytext NOT NULL,
  `Video` tinytext NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `RN_DBO_POST`
--

INSERT INTO `RN_DBO_POST` (`ID`, `UserID`, `Title`, `Description`, `UpTrust`, `DownTrust`, `YES`, `NO`, `Status`, `WorldStatus`, `Country`, `Region`, `City`, `ColVoView`, `Publication`, `Putdate`, `Foto`, `Video`) VALUES
(1, 34, 'Saluto Comorado!', 'Ĉi tiu estas la unua afiŝo de REDNET!', 32, 30, 22, 33, 1, 1, 'Ukraine', 'Kievska', 'Kiev', 0, 'ARH', '2021-03-24 22:13:45', '', ''),
(6, 33, 'Б. Пастернак', 'Быть знаменитым некрасиво.\r\nНе это подымает ввысь.\r\nНе надо заводить архива,\r\nНад рукописями трястись.\r\nЦель творчества  самоотдача,\r\nА не шумиха, не успех.\r\nПозорно ничего не знача,\r\nБыть притчей на устах у всех.\r\nНо надо жить без самозванства,\r\nТак жить, что бы в конце концов\r\nПривлечь к себе любовь пространства,\r\nУслышать будущего зов.\r\nИ надо оставлять пробелы\r\nВ судьбе, а не среди бумаг,\r\nМеста и главы жизни целой\r\nОтчеркивая на полях.\r\nИ окунаться в неизвестность,\r\nИ прятать в ней свои шаги,\r\nКак прячется в тумане местность,\r\nКогда в ней не видать ни зги.\r\nДругие по живому следу\r\nПройдут твой путь за пядью пядь,\r\nНо пораженья от победы\r\nТы сам не должен отличать.\r\nИ должен ни единой долькой\r\nНе отступаться от лица,\r\nНо быть живым, живым и только,\r\nЖивым и только до конца.', 15, 17, 8, 16, 2, 1, 'Ukraine', 'Kherson', 'Kherson', 0, 'OK!', '2021-03-23 18:37:50', '', ''),
(14, 41, 'Тест этого сайт', 'Сайт тестируем даажажажжасдсдссдсжсжсжсжсжссжсжмдмддплплппелелоеетепткш сумка ьеплпшщплплкш ПК пшк ПК пщ мак Тоддвбутаджвваььалвлвдщаьвлуьаладьалааащплплплп Слава Украине', 36, 22, 22, 31, 3, 1, 'Huh', 'Hih', 'Heh', 0, 'OK!', '2021-03-27 15:14:03', '', ''),
(18, 34, 'Новый пост для тестирования', 'Стих, стиховедческий термин, используемый в нескольких значениях: художественная речь, организованная делением на ритмически соизмеримые отрезки; поэзия в узком смысле; в частности, подразумевает свойства стихосложения той или иной традиции', 5, 4, 1, 4, 5, 4, 'Ukraine', 'Kherson', 'Kherson', 0, 'OK!', '2021-04-18 22:07:45', '', 'https://youtu.be/hqO3rpuvpmo'),
(19, 34, '12112', 'qerwertwertwertwert', 2, 4, 2, 2, 5, 4, 'Ukraine', 'Kherson', 'Kherson', 0, 'OK!', '2021-04-18 22:08:08', '', 'https://youtu.be/hqO3rpuvpmo');

-- --------------------------------------------------------

--
-- Структура таблицы `RN_DBO_SMS`
--

CREATE TABLE IF NOT EXISTS `RN_DBO_SMS` (
  `ID` bigint(20) NOT NULL,
  `UserID` bigint(20) NOT NULL,
  `FriendID` bigint(20) NOT NULL,
  `SMS` tinytext NOT NULL,
  `Putdate` datetime NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=93 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `RN_DBO_SMS`
--

INSERT INTO `RN_DBO_SMS` (`ID`, `UserID`, `FriendID`, `SMS`, `Putdate`) VALUES
(1, 34, 33, 'Привет Андрей!', '2021-03-26 23:36:28'),
(2, 34, 33, 'И еще раз привет!', '2021-03-26 23:37:32'),
(3, 34, 39, 'dfgdfdfgdfggggggg', '2021-03-26 23:47:37'),
(4, 39, 34, 'dfgdfdfgdfggggggg', '2021-03-26 23:47:46'),
(5, 34, 33, 'dfgdfdfgdfggggggg', '2021-03-26 23:49:30'),
(6, 34, 39, '1111111111111111111', '2021-03-26 23:49:35'),
(7, 34, 33, 'dfgdfdfgdfggggggg', '2021-03-26 23:52:11'),
(8, 34, 33, 'fgsdfghdfg', '2021-03-26 23:52:14'),
(9, 34, 33, 'dfgdfdfgdfggggggg', '2021-03-26 23:52:15'),
(10, 34, 33, 'vbncvbncv', '2021-03-26 23:52:18'),
(11, 33, 34, 'Инвертированнное', '2021-03-26 23:53:14'),
(12, 34, 33, 'dfgdfdfgdfggggggg', '2021-03-26 23:53:18'),
(13, 34, 39, 'erthefghdfg', '2021-03-27 00:33:40'),
(14, 34, 39, 'fghdfghdfgh', '2021-03-27 00:33:42'),
(15, 34, 39, 'dfghjdfgdfgh', '2021-03-27 00:33:44'),
(16, 34, 39, 'dfghjdfgdfgh', '2021-03-27 00:35:08'),
(17, 34, 39, 'dfghjdfgdfgh', '2021-03-27 00:36:42'),
(18, 34, 41, 'Привет Санек', '2021-03-27 15:19:58'),
(19, 41, 34, 'Продам гараж', '2021-03-27 15:20:01'),
(20, 41, 34, 'Продам гараж', '2021-03-27 15:20:15'),
(21, 41, 34, 'Продам гараж', '2021-03-27 15:20:18'),
(22, 34, 41, 'Сам продам', '2021-03-27 15:20:23'),
(23, 41, 34, 'Продам гараж', '2021-03-27 15:20:29'),
(24, 41, 34, 'Продам гараж', '2021-03-27 15:20:33'),
(25, 41, 34, 'Продам гараж', '2021-03-27 15:20:41'),
(26, 34, 41, 'ичсмичсм', '2021-03-27 15:20:46'),
(27, 41, 34, 'Продам гараж', '2021-03-27 15:20:47'),
(28, 41, 34, 'Продам гараж', '2021-03-27 15:20:50'),
(29, 41, 34, 'Продам гараж', '2021-03-27 15:20:52'),
(30, 41, 34, 'Продам гараж', '2021-03-27 15:20:53'),
(31, 34, 41, 'dfgdfdfgdfggggggg', '2021-03-27 15:20:58'),
(32, 34, 41, 'чсмичсми', '2021-03-27 15:21:05'),
(33, 34, 41, 'шото напиши', '2021-03-27 15:21:14'),
(34, 41, 33, 'Попоадаааььвьвь', '2021-03-27 15:21:23'),
(35, 41, 33, 'Попоадаааььвьвь', '2021-03-27 15:21:26'),
(36, 41, 33, 'Попоадаааььвьвь', '2021-03-27 15:21:27'),
(37, 41, 33, 'Попоадаааььвьвь', '2021-03-27 15:21:30'),
(38, 41, 33, 'Попоадаааььвьвь', '2021-03-27 15:21:31'),
(39, 41, 33, 'Попоадаааььвьвь', '2021-03-27 15:21:32'),
(40, 34, 41, 'ыапвапвап', '2021-03-27 15:22:39'),
(41, 34, 41, 'ыапвапвап', '2021-03-27 15:24:02'),
(42, 34, 41, 'ыапвапвап', '2021-03-27 15:24:15'),
(43, 34, 41, 'dfadsfgd', '2021-03-28 14:26:21'),
(44, 34, 41, 'dfadsfgd', '2021-03-28 14:26:34'),
(45, 34, 41, 'xcvxcv', '2021-03-28 14:26:47'),
(46, 34, 41, 'xcvxcv', '2021-03-28 14:26:50'),
(47, 34, 41, 'xcvxcv', '2021-03-28 14:26:53'),
(48, 34, 41, 'xcvxcv', '2021-03-28 14:26:55'),
(49, 34, 41, '1111111111111111111', '2021-03-29 01:31:20'),
(50, 34, 34, 'gdfgdfg', '2021-03-29 01:34:11'),
(51, 34, 34, 'dfgdfdfgdfggggggg', '2021-03-29 01:34:17'),
(52, 34, 34, 'dfgdfgfg', '2021-03-29 01:34:21'),
(53, 34, 34, 'dfgdfdfgdfggggggg', '2021-03-29 01:34:24'),
(54, 34, 34, 'dfgdfdfgdfggggggg', '2021-03-29 01:34:26'),
(55, 34, 34, 'Чо спасть?', '2021-03-29 01:34:35'),
(56, 34, 34, 'Хз, вроде не хочется пока', '2021-03-29 01:34:49'),
(57, 34, 34, 'хотя уже и сил нету', '2021-03-29 01:34:56'),
(58, 34, 41, '1111111111111111111', '2021-04-04 14:54:39'),
(59, 34, 41, 'dfgdfdfgdfggggggg', '2021-04-04 14:54:43'),
(60, 34, 41, '1111111111111111111', '2021-04-04 14:54:47'),
(61, 34, 41, 'Проверка работы чата', '2021-04-04 14:54:57'),
(62, 34, 41, '<b>sdfsfdsdfsdf</b>', '2021-04-04 14:56:00'),
(63, 34, 41, '<b>sdfsfdsdfsdf</b>', '2021-04-04 14:58:45'),
(64, 34, 41, '<b>sdfsfdsdfsdf</b>', '2021-04-04 14:59:07'),
(65, 34, 41, '<b>sdfsfdsdfsdf</b>', '2021-04-04 15:03:08'),
(66, 34, 41, '<b>sdfsfdsdfsdf</b>', '2021-04-04 15:03:16'),
(67, 34, 41, '1111111111111111111', '2021-04-05 22:14:40'),
(68, 34, 41, '1111111111111111111', '2021-04-05 22:16:19'),
(69, 34, 41, '1111111111111111111', '2021-04-05 22:20:45'),
(70, 34, 41, 'dfgdfdfgdfggggggg', '2021-04-05 22:21:50'),
(71, 34, 41, '3456345634564', '2021-04-05 22:21:58'),
(72, 34, 41, 'sdfsdfgsdfgsdfg', '2021-04-05 22:23:17'),
(73, 34, 41, 'dfgdfgdfg', '2021-04-05 22:50:22'),
(74, 34, 41, '2523523523523523452523452345', '2021-04-05 23:22:55'),
(75, 34, 41, '2345234523452345235235423542435', '2021-04-05 23:23:00'),
(76, 34, 41, '23452352345235234523452523', '2021-04-05 23:23:07'),
(77, 34, 41, '23452352345235234523452523', '2021-04-05 23:23:19'),
(78, 34, 41, '23452352345235234523452523', '2021-04-05 23:24:02'),
(79, 34, 41, '1111111111111111111', '2021-04-05 23:25:41'),
(80, 34, 33, 'Тестирование чата', '2021-04-06 12:44:37'),
(81, 33, 34, 'fbghdrhf', '2021-04-06 12:44:51'),
(82, 34, 44, 'ghhfghfgh', '2021-04-06 16:03:23'),
(83, 34, 41, 'dfgdfdfgdfggggggg', '2021-04-06 23:51:04'),
(84, 34, 33, 'dfgdfdfgdfggggggg', '2021-04-16 18:38:14'),
(85, 34, 33, 'fgsdfghdfg', '2021-04-16 18:38:22'),
(86, 34, 34, 'tutuyoto', '2021-04-16 20:39:42'),
(87, 34, 34, 'tyu9ot78', '2021-04-16 20:39:45'),
(88, 34, 34, '678906', '2021-04-16 20:39:47'),
(89, 34, 41, 'Rrtty', '2021-04-19 12:40:42'),
(90, 34, 44, 'Tyugfgh', '2021-04-19 12:41:05'),
(91, 34, 44, 'Fyjcfgh', '2021-04-19 12:41:17'),
(92, 34, 44, 'Hhjgff', '2021-04-19 12:41:37');

-- --------------------------------------------------------

--
-- Структура таблицы `RN_DBO_TRUST`
--

CREATE TABLE IF NOT EXISTS `RN_DBO_TRUST` (
  `ID` bigint(20) NOT NULL,
  `PostID` bigint(20) NOT NULL,
  `UserID` bigint(20) NOT NULL,
  `UpTrust` bigint(20) NOT NULL,
  `DownTrust` bigint(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `RN_DBO_UNION`
--

CREATE TABLE IF NOT EXISTS `RN_DBO_UNION` (
  `UnionID` bigint(20) NOT NULL,
  `UnionName` tinytext NOT NULL,
  `UnionDescription` varchar(600) NOT NULL,
  `UnionInterest` varchar(100) NOT NULL,
  `UnionAVATAR` tinytext NOT NULL,
  `UnionCreatorID` bigint(20) NOT NULL,
  `UnionModeratorID` bigint(20) NOT NULL,
  `UnionRedactorID` bigint(20) NOT NULL,
  `UnionWorld` char(7) NOT NULL,
  `UnionCountry` char(50) NOT NULL,
  `UnionRegion` char(50) NOT NULL,
  `UnionCity` char(50) NOT NULL,
  `Public` char(6) NOT NULL,
  `Putdate` datetime NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `RN_DBO_UNION`
--

INSERT INTO `RN_DBO_UNION` (`UnionID`, `UnionName`, `UnionDescription`, `UnionInterest`, `UnionAVATAR`, `UnionCreatorID`, `UnionModeratorID`, `UnionRedactorID`, `UnionWorld`, `UnionCountry`, `UnionRegion`, `UnionCity`, `Public`, `Putdate`) VALUES
(1, 'Марксистский Кружок', 'Кружок как кружок', 'Маркс,энгельс,коммунизм,социализм', '0', 34, 34, 34, '4', 'Ukraine', 'Kherson', 'Kherson', 'new', '2021-03-28 17:07:49'),
(2, 'Марксистский Кружок 2', 'Кружок как кружок 2', 'Маркс,энгельс,коммунизм,социализм', 'аватар', 34, 34, 34, '4', 'Ukraine', 'Kherson', 'Kherson', 'new', '2021-03-28 17:09:34'),
(3, 'Марксистский Кружок 3', 'Кружок как кружок 3', 'Маркс,энгельс,коммунизм,социализм', 'аватар', 34, 34, 34, '3', 'Ukraine', 'Kherson', 'Kherson', 'new', '2021-03-28 17:11:15'),
(4, 'Марксистский Кружок 4', 'Кружок как кружок 4', 'Маркс,энгельс,коммунизм,социализм', 'аватар', 34, 34, 34, '1', 'Ukraine', 'Kherson', 'Kherson', 'new', '2021-03-28 17:13:27'),
(5, 'Марксистский Кружок 5', 'Кружок как кружок 5', 'Маркс,энгельс,коммунизм,социализм', 'аватар', 34, 34, 34, '4', 'Ukraine', 'Kherson', 'Kherson', 'new', '2021-03-28 17:14:33'),
(6, 'Марксистский Кружок 6', 'Кружок как кружок 6', 'Маркс,энгельс,коммунизм,социализм', 'аватар', 34, 34, 34, '2', 'Ukraine', 'Kherson', 'Kherson', 'new', '2021-03-28 17:16:44'),
(7, 'Марксистский Кружок', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Vestibulum tincidunt est vitae ultrices accumsan. Aliquam ornare lacus adipiscing, posuere lectus et, fringilla augue.', 'Маркс,энгельс,коммунизм,социализм', 'аватар', 34, 34, 34, '2', 'Ukraine', 'Kherson', 'Kherson', 'new', '2021-03-28 17:17:35');

-- --------------------------------------------------------

--
-- Структура таблицы `RN_DBO_UNION_POST`
--

CREATE TABLE IF NOT EXISTS `RN_DBO_UNION_POST` (
  `UPostID` bigint(20) NOT NULL,
  `UnionID` bigint(20) NOT NULL,
  `UPCraterID` bigint(20) NOT NULL,
  `UPostName` tinytext NOT NULL,
  `UPostDescription` text NOT NULL,
  `Publication` char(6) NOT NULL,
  `Putdate` datetime NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=49 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `RN_DBO_UNION_POST`
--

INSERT INTO `RN_DBO_UNION_POST` (`UPostID`, `UnionID`, `UPCraterID`, `UPostName`, `UPostDescription`, `Publication`, `Putdate`) VALUES
(1, 7, 0, 'Новый пост в группе', 'ну это просто первый пост в группе', 'ok!', '2021-03-29 13:22:47'),
(2, 7, 34, 'Новый пост в группе', 'ну это просто первый пост в группе', 'ok!', '2021-03-29 13:24:51'),
(3, 7, 34, 'Новый пост в группе', 'ну это просто первый пост в группе', 'ok!', '2021-03-29 13:28:20'),
(4, 7, 34, 'Новый пост в группе', 'ну это просто первый пост в группе', 'ok!', '2021-03-29 13:28:34'),
(5, 7, 34, 'Новый пост в группе', 'ну это просто первый пост в группе', 'ok!', '2021-03-29 13:28:45'),
(6, 7, 34, 'Новый пост в группе', 'ну это просто первый пост в группе', 'ok!', '2021-03-29 13:31:19'),
(7, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:13:44'),
(8, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:13:44'),
(9, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:16:09'),
(10, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:17:39'),
(11, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:20:56'),
(12, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:22:57'),
(13, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:27:47'),
(14, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:29:04'),
(15, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:29:36'),
(16, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:32:05'),
(17, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:32:47'),
(18, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:33:10'),
(19, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:33:37'),
(20, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:34:25'),
(21, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:36:25'),
(22, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:37:07'),
(23, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:39:15'),
(24, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:42:58'),
(25, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:43:30'),
(26, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:44:04'),
(27, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:44:32'),
(28, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:45:20'),
(29, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:45:53'),
(30, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:46:40'),
(31, 7, 34, 'Еще один пост', 'ble for free, but their creator has made them available for Bootstrap free of cost. As a thank you, we only ask that you include a link back to Glyphicons whenever possible.', 'ok!', '2021-04-11 15:47:35'),
(32, 7, 34, 'Новый пост в группе', 'asdfasdfasdfasdfasdfas', 'ok!', '2021-04-11 16:14:07'),
(33, 7, 34, 'Новый пост в группе', 'asdfasdfasdfasdfasdfas', 'ok!', '2021-04-11 16:14:07'),
(34, 7, 34, 'Новый пост в группе', 'chcncvbn', 'ok!', '2021-04-11 21:05:30'),
(35, 7, 34, 'Новое видео', '', 'ok!', '2021-04-11 21:06:35'),
(36, 7, 34, 'dfgdfgdfg', '<iframe width="790" height="444" src="https://www.youtube.com/embed/ytAuMDXRVA8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>\r\n', 'ok!', '2021-04-11 21:09:44');

-- --------------------------------------------------------

--
-- Структура таблицы `RN_DBO_UNION_USERS`
--

CREATE TABLE IF NOT EXISTS `RN_DBO_UNION_USERS` (
  `ID` bigint(20) NOT NULL,
  `UnionID` bigint(20) NOT NULL,
  `UserID` bigint(20) NOT NULL,
  `Putdate` datetime NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `RN_DBO_UNION_USERS`
--

INSERT INTO `RN_DBO_UNION_USERS` (`ID`, `UnionID`, `UserID`, `Putdate`) VALUES
(100, 7, 34, '2021-04-19 19:56:36');

-- --------------------------------------------------------

--
-- Структура таблицы `RN_DBO_Users`
--

CREATE TABLE IF NOT EXISTS `RN_DBO_Users` (
  `UserID` int(11) NOT NULL,
  `UserNickName` char(30) NOT NULL,
  `UserEmail` char(50) NOT NULL,
  `UserPassword` char(200) NOT NULL,
  `UserAvatar` tinytext NOT NULL,
  `UserRole` char(6) NOT NULL,
  `Country` tinytext NOT NULL,
  `Region` tinytext NOT NULL,
  `City` tinytext NOT NULL,
  `UpTrust` int(11) NOT NULL,
  `DownTrust` int(11) NOT NULL,
  `Putdate` datetime NOT NULL,
  `DateOfBirth` date NOT NULL,
  `Proffesion` char(100) NOT NULL,
  `Hobby` tinytext NOT NULL,
  `SocialStatus` char(50) NOT NULL,
  `Education` char(100) NOT NULL,
  `LastEnterData` datetime NOT NULL,
  `Manifest` varchar(500) NOT NULL,
  `Gender` char(10) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `RN_DBO_Users`
--

INSERT INTO `RN_DBO_Users` (`UserID`, `UserNickName`, `UserEmail`, `UserPassword`, `UserAvatar`, `UserRole`, `Country`, `Region`, `City`, `UpTrust`, `DownTrust`, `Putdate`, `DateOfBirth`, `Proffesion`, `Hobby`, `SocialStatus`, `Education`, `LastEnterData`, `Manifest`, `Gender`) VALUES
(33, 'Space Dandy', 'twoandre@gmail.com', '$2y$10$BYqkzsCqZiLveMCz9Tsjiuy6N7ZoOGuvnqqTVDKSApOMaKMmNpb4C', '', 'user', 'Ukraine', 'Kherson', 'Kherson', 0, 0, '2021-03-21 22:12:49', '0000-00-00', '', '', '', '', '2021-04-06 12:51:47', '', ''),
(34, 'MorgenDorfer@meridian246m', 'meridian246m@gmail.com', '$2y$10$RkiumJDpAqiqHqnEKl0TZO6jUqWbH3fKurtQT5hYrOyUAS84q22ye', '/img/chegevara.jpg', 'user', 'Ukraine', 'Kherson', 'Kherson', 0, 0, '2021-03-21 22:13:20', '0000-00-00', 'Programme', 'Music', 'Student', 'High', '2021-05-01 21:35:11', 'Текст Моего манифеста', 'Male'),
(40, 'Daerr@fffff', 'fffff@gmail.com', '$2y$10$/whYCDPPxKR2otyMdFsM8OTf82oFiC.KX8pt9qSMbFc1iIPL8VKLi', 'Torolokao', 'user', 'Goal', 'Lol', 'Lolka', 0, 0, '2021-03-27 15:11:13', '0000-00-00', '', '', '', '', '0000-00-00 00:00:00', '', ''),
(41, 'Hoh@tot', 'tot@gmail.com', '$2y$10$EXLngLXDJRxGYmmQd9Mel.DIp/DcGvchupnDG9VI.W2IZegye0RUm', 'Hah', 'user', 'Huh', 'Hih', 'Heh', 0, 0, '2021-03-27 15:12:38', '0000-00-00', '', '', '', '', '0000-00-00 00:00:00', '', ''),
(44, 'Lozaddd@trader-mag', 'trader-mag@yandex.ru', '$2y$10$xBi7vNf6u1SMxuNcFHDP.OZOBpU3Z/KvGTQkkWwfpHHYOYpZtj.KO', 'avatar', 'user', 'Ukraine', 'Kherson', 'Kherson', 0, 0, '2021-04-06 13:35:50', '0000-00-00', '', '', '', '', '0000-00-00 00:00:00', '', '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `news_md`
--
ALTER TABLE `news_md`
  ADD PRIMARY KEY (`id_news`);

--
-- Индексы таблицы `RN_DBO_AGREE`
--
ALTER TABLE `RN_DBO_AGREE`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `RN_DBO_COMMENT`
--
ALTER TABLE `RN_DBO_COMMENT`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `RN_DBO_Config`
--
ALTER TABLE `RN_DBO_Config`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `RN_DBO_FRIENDS`
--
ALTER TABLE `RN_DBO_FRIENDS`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `RN_DBO_POST`
--
ALTER TABLE `RN_DBO_POST`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `Country_2` (`Country`),
  ADD KEY `Region_2` (`Region`),
  ADD KEY `City_2` (`City`),
  ADD FULLTEXT KEY `Title` (`Title`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Description` (`Description`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Country` (`Country`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Region` (`Region`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `City` (`City`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Title_2` (`Title`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Description_2` (`Description`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Country_3` (`Country`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Region_3` (`Region`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `City_3` (`City`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Title_3` (`Title`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Description_3` (`Description`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Description_4` (`Description`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Title_4` (`Title`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Title_5` (`Title`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Description_5` (`Description`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Title_6` (`Title`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Description_6` (`Description`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Title_7` (`Title`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Description_7` (`Description`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Title_8` (`Title`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Description_8` (`Description`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Title_9` (`Title`);
ALTER TABLE `RN_DBO_POST`
  ADD FULLTEXT KEY `Description_9` (`Description`);

--
-- Индексы таблицы `RN_DBO_SMS`
--
ALTER TABLE `RN_DBO_SMS`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `Putdate` (`Putdate`),
  ADD KEY `UserID` (`UserID`),
  ADD KEY `FriendID` (`FriendID`);

--
-- Индексы таблицы `RN_DBO_TRUST`
--
ALTER TABLE `RN_DBO_TRUST`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `RN_DBO_UNION`
--
ALTER TABLE `RN_DBO_UNION`
  ADD PRIMARY KEY (`UnionID`);

--
-- Индексы таблицы `RN_DBO_UNION_POST`
--
ALTER TABLE `RN_DBO_UNION_POST`
  ADD PRIMARY KEY (`UPostID`);

--
-- Индексы таблицы `RN_DBO_UNION_USERS`
--
ALTER TABLE `RN_DBO_UNION_USERS`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `RN_DBO_Users`
--
ALTER TABLE `RN_DBO_Users`
  ADD PRIMARY KEY (`UserID`),
  ADD KEY `UserEmail` (`UserEmail`),
  ADD KEY `DateOfBirth` (`DateOfBirth`),
  ADD FULLTEXT KEY `UserNickName` (`UserNickName`);
ALTER TABLE `RN_DBO_Users`
  ADD FULLTEXT KEY `Proffesion` (`Proffesion`);
ALTER TABLE `RN_DBO_Users`
  ADD FULLTEXT KEY `Hobby` (`Hobby`);
ALTER TABLE `RN_DBO_Users`
  ADD FULLTEXT KEY `SocialStatus` (`SocialStatus`);
ALTER TABLE `RN_DBO_Users`
  ADD FULLTEXT KEY `Education` (`Education`);
ALTER TABLE `RN_DBO_Users`
  ADD FULLTEXT KEY `Country` (`Country`);
ALTER TABLE `RN_DBO_Users`
  ADD FULLTEXT KEY `Region` (`Region`);
ALTER TABLE `RN_DBO_Users`
  ADD FULLTEXT KEY `City` (`City`);
ALTER TABLE `RN_DBO_Users`
  ADD FULLTEXT KEY `Proffesion_2` (`Proffesion`);
ALTER TABLE `RN_DBO_Users`
  ADD FULLTEXT KEY `Hobby_2` (`Hobby`);
ALTER TABLE `RN_DBO_Users`
  ADD FULLTEXT KEY `SocialStatus_2` (`SocialStatus`);
ALTER TABLE `RN_DBO_Users`
  ADD FULLTEXT KEY `Education_2` (`Education`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `news_md`
--
ALTER TABLE `news_md`
  MODIFY `id_news` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=9;
--
-- AUTO_INCREMENT для таблицы `RN_DBO_COMMENT`
--
ALTER TABLE `RN_DBO_COMMENT`
  MODIFY `ID` bigint(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=66;
--
-- AUTO_INCREMENT для таблицы `RN_DBO_Config`
--
ALTER TABLE `RN_DBO_Config`
  MODIFY `ID` int(1) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT для таблицы `RN_DBO_FRIENDS`
--
ALTER TABLE `RN_DBO_FRIENDS`
  MODIFY `ID` bigint(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=21;
--
-- AUTO_INCREMENT для таблицы `RN_DBO_POST`
--
ALTER TABLE `RN_DBO_POST`
  MODIFY `ID` bigint(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=20;
--
-- AUTO_INCREMENT для таблицы `RN_DBO_SMS`
--
ALTER TABLE `RN_DBO_SMS`
  MODIFY `ID` bigint(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=93;
--
-- AUTO_INCREMENT для таблицы `RN_DBO_UNION`
--
ALTER TABLE `RN_DBO_UNION`
  MODIFY `UnionID` bigint(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=8;
--
-- AUTO_INCREMENT для таблицы `RN_DBO_UNION_POST`
--
ALTER TABLE `RN_DBO_UNION_POST`
  MODIFY `UPostID` bigint(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=49;
--
-- AUTO_INCREMENT для таблицы `RN_DBO_UNION_USERS`
--
ALTER TABLE `RN_DBO_UNION_USERS`
  MODIFY `ID` bigint(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=101;
--
-- AUTO_INCREMENT для таблицы `RN_DBO_Users`
--
ALTER TABLE `RN_DBO_Users`
  MODIFY `UserID` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=45;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
